In [1]:
import pandas as pd

In [2]:
data =[num for num in range(0,10)]

series = pd.Series(data)
print(type(series))
print(series)

<class 'pandas.core.series.Series'>
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [7]:
data_set = pd.read_csv("student.csv")
print(data_set.head())

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [13]:
data = [10,20,30]
index = ['a','b','c']

a = pd.Series(data, index=index)
print(a.c)

30

In [32]:
# data_fram form dictionaries of list 

dex = { 
    "name" : ['soham','yash','ravi'],
    "age ":[num for num in range(0,3)],
    "type":[num for num in range(0,3)],
    "height" :[num for num in range(0,3)],
}
b = pd.DataFrame(dex)
print(b)
print(type(b))
print(b['name'])

    name  age   type  height
0  soham     0     0       0
1   yash     1     1       1
2   ravi     2     2       2
<class 'pandas.core.frame.DataFrame'>
0    soham
1     yash
2     ravi
Name: name, dtype: object

In [34]:
# create a daata frame using the dicoaries of list : 
t = [{'name':'soham','age':20,'gender':'male'},
     {'name':'soham','age':20,'gender':'male'},
     {'name':'soham','age':20,'gender':'male'},
     {'name':'soham','age':20,'gender':'male'}]
c = pd.DataFrame(t)
print(c)

    name  age gender
0  soham   20   male
1  soham   20   male
2  soham   20   male
3  soham   20   male

In [37]:
data = pd.read_csv('student.csv')
print(data.head(10))
print(data.tail())

   id         name  class  mark  gender
0   1     John Deo   Four    75  female
1   2     Max Ruin  Three    85    male
2   3       Arnold  Three    55    male
3   4   Krish Star   Four    60  female
4   5    John Mike   Four    60  female
5   6    Alex John   Four    55    male
6   7  My John Rob  Fifth    78    male
7   8       Asruid   Five    85    male
8   9      Tes Qry    Six    78    male
9  10     Big John   Four    55  female
    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [39]:
from tabulate import tabulate

In [48]:
print(b)
print(b['name'][1:])

    name  age   type  height
0  soham     0     0       0
1   yash     1     1       1
2   ravi     2     2       2
1    yash
2    ravi
Name: name, dtype: object

In [61]:
type(b['name'])

pandas.core.series.Series

In [85]:
print(b.loc[0:2])
print(type(b.loc[0:3,'name']))   # this is lable base indexing

    name  age   type  height
0  soham     0     0       0
1   yash     1     1       1
2   ravi     2     2       2
<class 'pandas.core.series.Series'>

In [93]:
print(b.iloc[0:,0])  # positional based indexing

0    soham
1     yash
2     ravi
Name: name, dtype: object

In [94]:
# Question 1 : Create a Pandas Series that stores names of 5 cities.
index = ['a','b','c','d','e']
citys = ['dwarka','ahamadabad','rajkot','vadodara','porbandar']

city_dt = pd.Series(citys,index = index)
print(city_dt['e'])

porbandar

In [102]:
#Question 2 : Create a DataFrame with 3 columns: Name, Age, Score.

dt = {'name':['ravi','soahm','yash'],
      'age':[21,20,19],
      'Score':[98,100,91],
      }
cl_data = pd.DataFrame(dt)
print(cl_data)
print(cl_data.loc[2])
print(cl_data.iloc[0:,2])
print(cl_data.at[1,'name']) # thoes are only
print(cl_data.iat[0,1]) # returns you a single value

    name  age  Score
0   ravi   21     98
1  soahm   20    100
2   yash   19     91
name     yash
age        19
Score      91
Name: 2, dtype: object
0     98
1    100
2     91
Name: Score, dtype: int64
soahm
21

In [104]:
cl_data

    name  age  Score
0   ravi   21     98
1  soahm   20    100
2   yash   19     91

In [109]:
cl_data['salary'] = [50000,60000,70000]
print(cl_data)
print(cl_data.drop('salary',axis = 1,inplace=True))# dfault axis value 0 which is row ,imnplace = true means work on the actual data 
print(cl_data)

    name  age  Score  salary
0   ravi   21     98   50000
1  soahm   20    100   60000
2   yash   19     91   70000
None
    name  age  Score
0   ravi   21     98
1  soahm   20    100
2   yash   19     91

In [134]:
cl_data['age'] += 1

cl_data.loc[2] = ['ravi',22,21]
cl_data.loc[0] =['soham',30,23]
cl_data.loc[3] = ['yash',32,12]

print(cl_data)

    name  age  Score
2   ravi   22     21
3   yash   32     12
0  soham   30     23

In [135]:
# cl_data.drop(1,inplace = True)
print(cl_data)
print("Data types : " , cl_data.dtypes)
print("Stastical summary : ",cl_data.describe())

    name  age  Score
2   ravi   22     21
3   yash   32     12
0  soham   30     23
Data types :  name     object
age       int64
Score     int64
dtype: object
Stastical summary :               age      Score
count   3.000000   3.000000
mean   28.000000  18.666667
std     5.291503   5.859465
min    22.000000  12.000000
25%    26.000000  16.500000
50%    30.000000  21.000000
75%    31.000000  22.000000
max    32.000000  23.000000

In [145]:
df =pd.read_csv('student.csv')
print(df.tail())
df.loc[35] = [36,'soahm','Ec',99,'male']

    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [ ]:
df['Rank'] = [i for i in range(0,36)]

In [150]:
print(df.head())
print(df.tail(2))

   id        name  class  mark  gender  Rank
0   1    John Deo   Four    75  female     0
1   2    Max Ruin  Three    85    male     1
2   3      Arnold  Three    55    male     2
3   4  Krish Star   Four    60  female     3
4   5   John Mike   Four    60  female     4
    id        name class  mark  gender  Rank
34  35  Rows Noump   Six    88  female    34
35  36       soahm    Ec    99    male    35

In [154]:
print(df[(df['mark']>80) & (df['Rank']<20)])

    id      name  class  mark  gender  Rank
1    2  Max Ruin  Three    85    male     1
7    8    Asruid   Five    85    male     7
10  11    Ronald    Six    89  female    10
11  12     Recky    Six    94  female    11
12  13       Kty  Seven    88  female    12
13  14      Bigy  Seven    88  female    13
14  15  Tade Row   Four    88    male    14
15  16     Gimmy   Four    88    male    15

In [176]:
df = pd.read_csv("Diabetes_Missing_Data.csv")
print(df.head())
print(df.size)

   Pregnant  Glucose  Diastolic_BP  Skin_Fold  Serum_Insulin   BMI  \
0         6    148.0          72.0       35.0            NaN  33.6
1         1     85.0          66.0       29.0            NaN  26.6
2         8    183.0          64.0        NaN            NaN  23.3
3         1     89.0          66.0       23.0           94.0  28.1
4         0    137.0          40.0       35.0          168.0  43.1

   Diabetes_Pedigree  Age  Class
0              0.627   50      1
1              0.351   31      0
2              0.672   32      1
3              0.167   21      0
4              2.288   33      1
6912

In [177]:
print(df.isnull())

     Pregnant  Glucose  Diastolic_BP  Skin_Fold  Serum_Insulin    BMI  \
0       False    False         False      False           True  False
1       False    False         False      False           True  False
2       False    False         False       True           True  False
3       False    False         False      False          False  False
4       False    False         False      False          False  False
..        ...      ...           ...        ...            ...    ...
763     False    False         False      False          False  False
764     False    False         False      False           True  False
765     False    False         False      False          False  False
766     False    False         False       True           True  False
767     False    False         False      False           True  False

     Diabetes_Pedigree    Age  Class
0                False  False  False
1                False  False  False
2                False  False  False
3                False  False  False
4                False  False  False
..                 ...    ...    ...
763              False  False  False
764              False  False  False
765              False  False  False
766              False  False  False
767              False  False  False

[768 rows x 9 columns]

In [178]:
print(df.dropna())

     Pregnant  Glucose  Diastolic_BP  Skin_Fold  Serum_Insulin   BMI  \
3           1     89.0          66.0       23.0           94.0  28.1
4           0    137.0          40.0       35.0          168.0  43.1
6           3     78.0          50.0       32.0           88.0  31.0
8           2    197.0          70.0       45.0          543.0  30.5
13          1    189.0          60.0       23.0          846.0  30.1
..        ...      ...           ...        ...            ...   ...
753         0    181.0          88.0       44.0          510.0  43.3
755         1    128.0          88.0       39.0          110.0  36.5
760         2     88.0          58.0       26.0           16.0  28.4
763        10    101.0          76.0       48.0          180.0  32.9
765         5    121.0          72.0       23.0          112.0  26.2

     Diabetes_Pedigree  Age  Class
3                0.167   21      0
4                2.288   33      1
6                0.248   26      1
8                0.158   53      1
13               0.398   59      1
..                 ...  ...    ...
753              0.222   26      1
755              1.057   37      1
760              0.766   22      0
763              0.171   63      0
765              0.245   30      0

[392 rows x 9 columns]

In [181]:
df.fillna(10,inplace=True)

In [182]:
print(df.isna().sum())

Pregnant             0
Glucose              0
Diastolic_BP         0
Skin_Fold            0
Serum_Insulin        0
BMI                  0
Diabetes_Pedigree    0
Age                  0
Class                0
dtype: int64

In [188]:
# Qestion  1 : 
# Preparing the data 
dt = {'City':['rajkot','ahmadabad','dwarka','vadodara'],
      'population':[10.7,20.9,0.89,1.10],
      'area':[6.7,4,3,3]}
df = pd.DataFrame(dt)
print(df)
#Filter rows where population is greater than 1 million.
print(df[df['population']>1])

        City  population  area
0     rajkot       10.70   6.7
1  ahmadabad       20.90   4.0
2     dwarka        0.89   3.0
3   vadodara        1.10   3.0
        City  population  area
0     rajkot        10.7   6.7
1  ahmadabad        20.9   4.0
3   vadodara         1.1   3.0

In [195]:
# Question 2 : Country, Capital, Population, GDP

row_dt = {'Country':['india','usa','france'],
          'Capital':['Delhi',None,None],
          'Population':[1,2,None],
          'GDP':[None,4,2]}
df = pd.DataFrame(row_dt)
print(df)
#Fill any missing data with the value 0.
print(df.isnull())
print(df.dropna())
print(df.fillna(0,inplace= True))
print(df)

  Country Capital  Population  GDP
0   india   Delhi         1.0  NaN
1     usa    None         2.0  4.0
2  france    None         NaN  2.0
   Country  Capital  Population    GDP
0    False    False       False   True
1    False     True       False  False
2    False     True        True  False
Empty DataFrame
Columns: [Country, Capital, Population, GDP]
Index: []
None
  Country Capital  Population  GDP
0   india   Delhi         1.0  0.0
1     usa       0         2.0  4.0
2  france       0         0.0  2.0

In [196]:
# merging data based upon something 
df1 = pd.DataFrame({
    "ID": [1, 2, 3],
    "Name": ["John", "Alice", "Bob"]
})

df2 = pd.DataFrame({
    "ID": [1, 2, 3],
    "Age": [23, 24, 25]
})

df = pd.merge(df1,df2,on='ID')
print(df)

   ID   Name  Age
0   1   John   23
1   2  Alice   24
2   3    Bob   25

In [198]:
#concatinate data 

df1 = pd.DataFrame({
    "Name": ["John", "Alice"],
    "Age": [23, 24]
})

df2 = pd.DataFrame({
    "Name": ["Bob", "Charlie"],
    "Age": [25, 26]
})

concatinate_data = pd.concat([df1,df2],ignore_index=True)
print(concatinate_data)

      Name  Age
0     John   23
1    Alice   24
2      Bob   25
3  Charlie   26

In [199]:
df = pd.DataFrame({
    "Date": ["2022-01-01", "2022-01-02", "2022-01-03"],
    "Product": ["Laptop", "Phone", "Tablet"],
    "Price": [1000, 500, 300]
})

# Pivot: Turn data from long format to wide format
pivoted_df = df.pivot(index="Date", columns="Product", values="Price")
print(pivoted_df)

# Melt: Convert data from wide to long format
melted_df = df.melt(id_vars=["Date"], value_vars=["Product", "Price"])
print(melted_df)

Product     Laptop  Phone  Tablet
Date
2022-01-01  1000.0    NaN     NaN
2022-01-02     NaN  500.0     NaN
2022-01-03     NaN    NaN   300.0
         Date variable   value
0  2022-01-01  Product  Laptop
1  2022-01-02  Product   Phone
2  2022-01-03  Product  Tablet
3  2022-01-01    Price    1000
4  2022-01-02    Price     500
5  2022-01-03    Price     300

In [201]:
# Question 1 : 
df1 = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'City': ['New York', 'Los Angeles', 'Chicago']
})

df2 = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
})
df = pd.merge(df1,df2,on='Name')
print(df)

      Name         City  Age
0    Alice     New York   25
1      Bob  Los Angeles   30
2  Charlie      Chicago   35

In [204]:
# Question 2  : 
df_sales = pd.DataFrame({
    'Date': ['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04', '2025-01-05'],
    'Product': ['Laptop', 'Phone', 'Tablet', 'Monitor', 'Headphones'],
    'Sales': [1500, 1200, 800, 1000, 600]
})
#Pivot the DataFrame to show products as columns and dates as rows.
pivoted_var = df.pivot(index='Date',columns='Product',values='sales')

print(df)

KeyError: 'Date'

In [210]:
# data_manupulation : 

df = pd.read_csv('student.csv')
df.head(5)  # it's gives tabuler output becasue of print function

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [209]:
df.tail(5)

    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [211]:
df.describe()

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

In [212]:
df2 = pd.read_csv('Diabetes_Missing_Data.csv')
df2.head(5)

,Pregnant,Glucose,Diastolic_BP,Skin_Fold,Serum_Insulin,BMI,Diabetes_Pedigree,Age,Class
0,6,148.0,72.0,35.0,NaN,33.6,0.627,50,1
1,1,85.0,66.0,29.0,NaN,26.6,0.351,31,0
2,8,183.0,64.0,NaN,NaN,23.3,0.672,32,1
3,1,89.0,66.0,23.0,94.0,28.1,0.167,21,0
4,0,137.0,40.0,35.0,168.0,43.1,2.288,33,1

In [218]:
df2.isnull().sum()

Pregnant               0
Glucose                5
Diastolic_BP          35
Skin_Fold            227
Serum_Insulin        374
BMI                   11
Diabetes_Pedigree      0
Age                    0
Class                  0
dtype: int64

In [219]:
df2.isnull().any()

Pregnant             False
Glucose               True
Diastolic_BP          True
Skin_Fold             True
Serum_Insulin         True
BMI                   True
Diabetes_Pedigree    False
Age                  False
Class                False
dtype: bool

In [221]:
df_filed = df2.fillna(0)

In [223]:
# filling missing value of mean of the column

df2['filled_Diastolic_BP'] = df2["Diastolic_BP"].fillna(df2['Diastolic_BP'].mean())
df2.filled_Diastolic_BP

0      72.0
1      66.0
2      64.0
3      66.0
4      40.0
       ...
763    76.0
764    70.0
765    72.0
766    60.0
767    70.0
Name: filled_Diastolic_BP, Length: 768, dtype: float64

In [227]:
df2.head()

,Pregnant,Glucose,Diastolic_BP,Skin_Fold,Serum_Insulin,BMI,Diabetes_Pedigree,Age,Class,filled_Diastolic_BP
0,6,148.0,72.0,35.0,NaN,33.6,0.627,50,1,72.0
1,1,85.0,66.0,29.0,NaN,26.6,0.351,31,0,66.0
2,8,183.0,64.0,NaN,NaN,23.3,0.672,32,1,64.0
3,1,89.0,66.0,23.0,94.0,28.1,0.167,21,0,66.0
4,0,137.0,40.0,35.0,168.0,43.1,2.288,33,1,40.0

In [228]:
df2.dtypes

Pregnant                 int64
Glucose                float64
Diastolic_BP           float64
Skin_Fold              float64
Serum_Insulin          float64
BMI                    float64
Diabetes_Pedigree      float64
Age                      int64
Class                    int64
filled_Diastolic_BP    float64
dtype: object

In [229]:
# changing the data type and name : 
df2.rename(columns={'Pregnant':"Pregnant_lady"},inplace=True)
df2.head()

,Pregnant_lady,Glucose,Diastolic_BP,Skin_Fold,Serum_Insulin,BMI,Diabetes_Pedigree,Age,Class,filled_Diastolic_BP
0,6,148.0,72.0,35.0,NaN,33.6,0.627,50,1,72.0
1,1,85.0,66.0,29.0,NaN,26.6,0.351,31,0,66.0
2,8,183.0,64.0,NaN,NaN,23.3,0.672,32,1,64.0
3,1,89.0,66.0,23.0,94.0,28.1,0.167,21,0,66.0
4,0,137.0,40.0,35.0,168.0,43.1,2.288,33,1,40.0

In [230]:
df2.dtypes

Pregnant_lady            int64
Glucose                float64
Diastolic_BP           float64
Skin_Fold              float64
Serum_Insulin          float64
BMI                    float64
Diabetes_Pedigree      float64
Age                      int64
Class                    int64
filled_Diastolic_BP    float64
dtype: object

In [253]:
df2.columns = df2.columns.str.strip().str.lower()
if 'pregnant_lady'in df2.columns:
    df2['pregnant_lady_float'] = df2["pregnant_lady"].astype(float)
else:
     print("column not found ")
df2.head()

,pregnant_lady,glucose,diastolic_bp,skin_fold,serum_insulin,bmi,diabetes_pedigree,age,class,filled_diastolic_bp,pregnant_lady_float
0,6,148.0,72.0,35.0,NaN,33.6,0.627,50,1,72.0,6.0
1,1,85.0,66.0,29.0,NaN,26.6,0.351,31,0,66.0,1.0
2,8,183.0,64.0,NaN,NaN,23.3,0.672,32,1,64.0,8.0
3,1,89.0,66.0,23.0,94.0,28.1,0.167,21,0,66.0,1.0
4,0,137.0,40.0,35.0,168.0,43.1,2.288,33,1,40.0,0.0

In [236]:
df2.columns.tolist() # shows the columns name cleary

['Pregnant_lady',
 'Glucose',
 'Diastolic_BP',
 'Skin_Fold',
 'Serum_Insulin',
 'BMI',
 'Diabetes_Pedigree',
 'Age',
 'Class',
 'filled_Diastolic_BP']

In [239]:
# to remove the spaces in the columns 

df2.columns.str.strip()

Index(['Pregnant_lady', 'Glucose', 'Diastolic_BP', 'Skin_Fold',
       'Serum_Insulin', 'BMI', 'Diabetes_Pedigree', 'Age', 'Class',
       'filled_Diastolic_BP'],
      dtype='object')

In [243]:
df2.shape # gives the shape of the datafram

(768, 10)

In [244]:
# force lower case index conversion : 

df2.columns.str.lower()

Index(['pregnant_lady', 'glucose', 'diastolic_bp', 'skin_fold',
       'serum_insulin', 'bmi', 'diabetes_pedigree', 'age', 'class',
       'filled_diastolic_bp'],
      dtype='object')

In [254]:
# apply function to the perticuler column  

df2["new_filled_diastolic_bp"] = df2["filled_diastolic_bp"].apply(lambda x :x*2)
df2.head()

,pregnant_lady,glucose,diastolic_bp,skin_fold,serum_insulin,bmi,diabetes_pedigree,age,class,filled_diastolic_bp,pregnant_lady_float,new_filled_diastolic_bp
0,6,148.0,72.0,35.0,NaN,33.6,0.627,50,1,72.0,6.0,144.0
1,1,85.0,66.0,29.0,NaN,26.6,0.351,31,0,66.0,1.0,132.0
2,8,183.0,64.0,NaN,NaN,23.3,0.672,32,1,64.0,8.0,128.0
3,1,89.0,66.0,23.0,94.0,28.1,0.167,21,0,66.0,1.0,132.0
4,0,137.0,40.0,35.0,168.0,43.1,2.288,33,1,40.0,0.0,80.0

In [255]:
# group by practice : 

df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [256]:
grouped_mean = df.groupby('class')['mark'].mean()
print(grouped_mean)

class
Eight    79.000000
Fifth    78.000000
Five     80.000000
Four     70.888889
Nine     41.500000
Seven    77.600000
Six      82.571429
Three    73.666667
Name: mark, dtype: float64

In [258]:
# gouped data # # depended upon the data 

# gouped_sum = df.groupby('class','id')['mark'].sum()
# print(gouped_sum)

In [260]:
# aggregate muklitple fucntion : 

agge_multi = df.groupby('class')['mark'].agg(['mean','sum','median','count'])
print(agge_multi)

            mean  sum  median  count
class
Eight  79.000000   79    79.0      1
Fifth  78.000000   78    78.0      1
Five   80.000000  160    80.0      2
Four   70.888889  638    69.0      9
Nine   41.500000   83    41.5      2
Seven  77.600000  776    82.5     10
Six    82.571429  578    88.0      7
Three  73.666667  221    81.0      3